GopalSaraf/Practicals/PSDL/include/proc/pic16f18344.inc
// Register: TMR0H
#define TMR0H TMR0H
TMR0H                                    equ 0016h
// bitfield definitions
TMR0H_TMR0H_POSN                         equ 0000h
TMR0H_TMR0H_POSITION                     equ 0000h
TMR0H_TMR0H_SIZE                         equ 0008h
TMR0H_TMR0H_LENGTH                       equ 0008h
TMR0H_TMR0H_MASK                         equ 00FFh
TMR0H_TMR08_POSN                         equ 0000h
TMR0H_TMR08_POSITION                     equ 0000h
TMR0H_TMR08_SIZE                         equ 0001h
TMR0H_TMR08_LENGTH                       equ 0001h
TMR0H_TMR08_MASK                         equ 0001h
TMR0H_TMR09_POSN                         equ 0001h
TMR0H_TMR09_POSITION                     equ 0001h
TMR0H_TMR09_SIZE                         equ 0001h
TMR0H_TMR09_LENGTH                       equ 0001h
TMR0H_TMR09_MASK                         equ 0002h
TMR0H_TMR010_POSN                        equ 0002h
TMR0H_TMR010_POSITION                    equ 0002h
TMR0H_TMR010_SIZE                        equ 0001h
TMR0H_TMR010_LENGTH                      equ 0001h
TMR0H_TMR010_MASK                        equ 0004h
TMR0H_TMR011_POSN                        equ 0003h
TMR0H_TMR011_POSITION                    equ 0003h
TMR0H_TMR011_SIZE                        equ 0001h
TMR0H_TMR011_LENGTH                      equ 0001h
TMR0H_TMR011_MASK                        equ 0008h
TMR0H_TMR012_POSN                        equ 0004h
TMR0H_TMR012_POSITION                    equ 0004h
TMR0H_TMR012_SIZE                        equ 0001h
TMR0H_TMR012_LENGTH                      equ 0001h
TMR0H_TMR012_MASK                        equ 0010h
TMR0H_TMR013_POSN                        equ 0005h
TMR0H_TMR013_POSITION                    equ 0005h
TMR0H_TMR013_SIZE                        equ 0001h
TMR0H_TMR013_LENGTH                      equ 0001h
TMR0H_TMR013_MASK                        equ 0020h
TMR0H_TMR014_POSN                        equ 0006h
TMR0H_TMR014_POSITION                    equ 0006h
TMR0H_TMR014_SIZE                        equ 0001h
TMR0H_TMR014_LENGTH                      equ 0001h
TMR0H_TMR014_MASK                        equ 0040h
TMR0H_TMR015_POSN                        equ 0007h
TMR0H_TMR015_POSITION                    equ 0007h
TMR0H_TMR015_SIZE                        equ 0001h
TMR0H_TMR015_LENGTH                      equ 0001h
TMR0H_TMR015_MASK                        equ 0080h
TMR0H_PR00_POSN                          equ 0000h
TMR0H_PR00_POSITION                      equ 0000h
TMR0H_PR00_SIZE                          equ 0001h
TMR0H_PR00_LENGTH                        equ 0001h
TMR0H_PR00_MASK                          equ 0001h
TMR0H_PR01_POSN                          equ 0001h
TMR0H_PR01_POSITION                      equ 0001h
TMR0H_PR01_SIZE                          equ 0001h
TMR0H_PR01_LENGTH                        equ 0001h
TMR0H_PR01_MASK                          equ 0002h
TMR0H_PR02_POSN                          equ 0002h
TMR0H_PR02_POSITION                      equ 0002h
TMR0H_PR02_SIZE                          equ 0001h
TMR0H_PR02_LENGTH                        equ 0001h
TMR0H_PR02_MASK                          equ 0004h
TMR0H_PR03_POSN                          equ 0003h
TMR0H_PR03_POSITION                      equ 0003h
TMR0H_PR03_SIZE                          equ 0001h
TMR0H_PR03_LENGTH                        equ 0001h
TMR0H_PR03_MASK                          equ 0008h
TMR0H_PR04_POSN                          equ 0004h
TMR0H_PR04_POSITION                      equ 0004h
TMR0H_PR04_SIZE                          equ 0001h
TMR0H_PR04_LENGTH                        equ 0001h
TMR0H_PR04_MASK                          equ 0010h
TMR0H_PR05_POSN                          equ 0005h
TMR0H_PR05_POSITION                      equ 0005h
TMR0H_PR05_SIZE                          equ 0001h
TMR0H_PR05_LENGTH                        equ 0001h
TMR0H_PR05_MASK                          equ 0020h
TMR0H_PR06_POSN                          equ 0006h
TMR0H_PR06_POSITION                      equ 0006h
TMR0H_PR06_SIZE                          equ 0001h
TMR0H_PR06_LENGTH                        equ 0001h
TMR0H_PR06_MASK                          equ 0040h
TMR0H_PR07_POSN                          equ 0007h
TMR0H_PR07_POSITION                      equ 0007h
TMR0H_PR07_SIZE                          equ 0001h
TMR0H_PR07_LENGTH                        equ 0001h
TMR0H_PR07_MASK                          equ 0080h
TMR0H_PR0_POSN                           equ 0000h
TMR0H_PR0_POSITION                       equ 0000h
TMR0H_PR0_SIZE                           equ 0008h
TMR0H_PR0_LENGTH                         equ 0008h
TMR0H_PR0_MASK                           equ 00FFh

// Register: T0CON0
#define T0CON0 T0CON0
T0CON0                                   equ 0017h
// bitfield definitions
T0CON0_T0OUTPS_POSN                      equ 0000h
T0CON0_T0OUTPS_POSITION                  equ 0000h
T0CON0_T0OUTPS_SIZE                      equ 0004h
T0CON0_T0OUTPS_LENGTH                    equ 0004h
T0CON0_T0OUTPS_MASK                      equ 000Fh
T0CON0_T016BIT_POSN                      equ 0004h
T0CON0_T016BIT_POSITION                  equ 0004h
T0CON0_T016BIT_SIZE                      equ 0001h
T0CON0_T016BIT_LENGTH                    equ 0001h
T0CON0_T016BIT_MASK                      equ 0010h
T0CON0_T0OUT_POSN                        equ 0005h
T0CON0_T0OUT_POSITION                    equ 0005h
T0CON0_T0OUT_SIZE                        equ 0001h
T0CON0_T0OUT_LENGTH                      equ 0001h
T0CON0_T0OUT_MASK                        equ 0020h
T0CON0_T0EN_POSN                         equ 0007h
T0CON0_T0EN_POSITION                     equ 0007h
T0CON0_T0EN_SIZE                         equ 0001h
T0CON0_T0EN_LENGTH                       equ 0001h
T0CON0_T0EN_MASK                         equ 0080h
T0CON0_T0OUTPS0_POSN                     equ 0000h
T0CON0_T0OUTPS0_POSITION                 equ 0000h
T0CON0_T0OUTPS0_SIZE                     equ 0001h
T0CON0_T0OUTPS0_LENGTH                   equ 0001h
T0CON0_T0OUTPS0_MASK                     equ 0001h
T0CON0_T0OUTPS1_POSN                     equ 0001h
T0CON0_T0OUTPS1_POSITION                 equ 0001h
T0CON0_T0OUTPS1_SIZE                     equ 0001h
T0CON0_T0OUTPS1_LENGTH                   equ 0001h
T0CON0_T0OUTPS1_MASK                     equ 0002h
T0CON0_T0OUTPS2_POSN                     equ 0002h
T0CON0_T0OUTPS2_POSITION                 equ 0002h
T0CON0_T0OUTPS2_SIZE                     equ 0001h
T0CON0_T0OUTPS2_LENGTH                   equ 0001h
T0CON0_T0OUTPS2_MASK                     equ 0004h
T0CON0_T0OUTPS3_POSN                     equ 0003h
T0CON0_T0OUTPS3_POSITION                 equ 0003h
T0CON0_T0OUTPS3_SIZE                     equ 0001h
T0CON0_T0OUTPS3_LENGTH                   equ 0001h
T0CON0_T0OUTPS3_MASK                     equ 0008h

