GopalSaraf/Practicals/PSDL/include/proc/pic16f18344.inc
// Register: SSP1CLKPPS
#define SSP1CLKPPS SSP1CLKPPS
SSP1CLKPPS                               equ 0E20h
// bitfield definitions
SSP1CLKPPS_SSP1CLKPPS_POSN               equ 0000h
SSP1CLKPPS_SSP1CLKPPS_POSITION           equ 0000h
SSP1CLKPPS_SSP1CLKPPS_SIZE               equ 0005h
SSP1CLKPPS_SSP1CLKPPS_LENGTH             equ 0005h
SSP1CLKPPS_SSP1CLKPPS_MASK               equ 001Fh
SSP1CLKPPS_SSP1CLKPPS0_POSN              equ 0000h
SSP1CLKPPS_SSP1CLKPPS0_POSITION          equ 0000h
SSP1CLKPPS_SSP1CLKPPS0_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS0_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS0_MASK              equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_POSN              equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_POSITION          equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_MASK              equ 0002h
SSP1CLKPPS_SSP1CLKPPS2_POSN              equ 0002h
SSP1CLKPPS_SSP1CLKPPS2_POSITION          equ 0002h
SSP1CLKPPS_SSP1CLKPPS2_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS2_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS2_MASK              equ 0004h
SSP1CLKPPS_SSP1CLKPPS3_POSN              equ 0003h
SSP1CLKPPS_SSP1CLKPPS3_POSITION          equ 0003h
SSP1CLKPPS_SSP1CLKPPS3_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS3_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS3_MASK              equ 0008h
SSP1CLKPPS_SSP1CLKPPS4_POSN              equ 0004h
SSP1CLKPPS_SSP1CLKPPS4_POSITION          equ 0004h
SSP1CLKPPS_SSP1CLKPPS4_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS4_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS4_MASK              equ 0010h

// Register: SSP1DATPPS
#define SSP1DATPPS SSP1DATPPS
SSP1DATPPS                               equ 0E21h
// bitfield definitions
SSP1DATPPS_SSP1DATPPS_POSN               equ 0000h
SSP1DATPPS_SSP1DATPPS_POSITION           equ 0000h
SSP1DATPPS_SSP1DATPPS_SIZE               equ 0005h
SSP1DATPPS_SSP1DATPPS_LENGTH             equ 0005h
SSP1DATPPS_SSP1DATPPS_MASK               equ 001Fh
SSP1DATPPS_SSP1DATPPS0_POSN              equ 0000h
SSP1DATPPS_SSP1DATPPS0_POSITION          equ 0000h
SSP1DATPPS_SSP1DATPPS0_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS0_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS0_MASK              equ 0001h
SSP1DATPPS_SSP1DATPPS1_POSN              equ 0001h
SSP1DATPPS_SSP1DATPPS1_POSITION          equ 0001h
SSP1DATPPS_SSP1DATPPS1_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS1_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS1_MASK              equ 0002h
SSP1DATPPS_SSP1DATPPS2_POSN              equ 0002h
SSP1DATPPS_SSP1DATPPS2_POSITION          equ 0002h
SSP1DATPPS_SSP1DATPPS2_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS2_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS2_MASK              equ 0004h
SSP1DATPPS_SSP1DATPPS3_POSN              equ 0003h
SSP1DATPPS_SSP1DATPPS3_POSITION          equ 0003h
SSP1DATPPS_SSP1DATPPS3_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS3_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS3_MASK              equ 0008h
SSP1DATPPS_SSP1DATPPS4_POSN              equ 0004h
SSP1DATPPS_SSP1DATPPS4_POSITION          equ 0004h
SSP1DATPPS_SSP1DATPPS4_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS4_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS4_MASK              equ 0010h

// Register: SSP1SSPPS
#define SSP1SSPPS SSP1SSPPS
SSP1SSPPS                                equ 0E22h
// bitfield definitions
SSP1SSPPS_SSP1SSPPS_POSN                 equ 0000h
SSP1SSPPS_SSP1SSPPS_POSITION             equ 0000h
SSP1SSPPS_SSP1SSPPS_SIZE                 equ 0005h
SSP1SSPPS_SSP1SSPPS_LENGTH               equ 0005h
SSP1SSPPS_SSP1SSPPS_MASK                 equ 001Fh
SSP1SSPPS_SSP1SSPPS0_POSN                equ 0000h
SSP1SSPPS_SSP1SSPPS0_POSITION            equ 0000h
SSP1SSPPS_SSP1SSPPS0_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS0_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS0_MASK                equ 0001h
SSP1SSPPS_SSP1SSPPS1_POSN                equ 0001h
SSP1SSPPS_SSP1SSPPS1_POSITION            equ 0001h
SSP1SSPPS_SSP1SSPPS1_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS1_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS1_MASK                equ 0002h
SSP1SSPPS_SSP1SSPPS2_POSN                equ 0002h
SSP1SSPPS_SSP1SSPPS2_POSITION            equ 0002h
SSP1SSPPS_SSP1SSPPS2_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS2_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS2_MASK                equ 0004h
SSP1SSPPS_SSP1SSPPS3_POSN                equ 0003h
SSP1SSPPS_SSP1SSPPS3_POSITION            equ 0003h
SSP1SSPPS_SSP1SSPPS3_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS3_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS3_MASK                equ 0008h
SSP1SSPPS_SSP1SSPPS4_POSN                equ 0004h
SSP1SSPPS_SSP1SSPPS4_POSITION            equ 0004h
SSP1SSPPS_SSP1SSPPS4_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS4_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS4_MASK                equ 0010h

// Register: RXPPS
#define RXPPS RXPPS
RXPPS                                    equ 0E24h
// bitfield definitions
RXPPS_RXPPS_POSN                         equ 0000h
RXPPS_RXPPS_POSITION                     equ 0000h
RXPPS_RXPPS_SIZE                         equ 0005h
RXPPS_RXPPS_LENGTH                       equ 0005h
RXPPS_RXPPS_MASK                         equ 001Fh
RXPPS_RXDTPPS0_POSN                      equ 0000h
RXPPS_RXDTPPS0_POSITION                  equ 0000h
RXPPS_RXDTPPS0_SIZE                      equ 0001h
RXPPS_RXDTPPS0_LENGTH                    equ 0001h
RXPPS_RXDTPPS0_MASK                      equ 0001h
RXPPS_RXDTPPS1_POSN                      equ 0001h
RXPPS_RXDTPPS1_POSITION                  equ 0001h
RXPPS_RXDTPPS1_SIZE                      equ 0001h
RXPPS_RXDTPPS1_LENGTH                    equ 0001h
RXPPS_RXDTPPS1_MASK                      equ 0002h
RXPPS_RXDTPPS2_POSN                      equ 0002h
RXPPS_RXDTPPS2_POSITION                  equ 0002h
RXPPS_RXDTPPS2_SIZE                      equ 0001h
RXPPS_RXDTPPS2_LENGTH                    equ 0001h
RXPPS_RXDTPPS2_MASK                      equ 0004h
RXPPS_RXDTPPS3_POSN                      equ 0003h
RXPPS_RXDTPPS3_POSITION                  equ 0003h
RXPPS_RXDTPPS3_SIZE                      equ 0001h
RXPPS_RXDTPPS3_LENGTH                    equ 0001h
RXPPS_RXDTPPS3_MASK                      equ 0008h
RXPPS_RXDTPPS4_POSN                      equ 0004h
RXPPS_RXDTPPS4_POSITION                  equ 0004h
RXPPS_RXDTPPS4_SIZE                      equ 0001h
RXPPS_RXDTPPS4_LENGTH                    equ 0001h
RXPPS_RXDTPPS4_MASK                      equ 0010h

// Register: TXPPS
#define TXPPS TXPPS
TXPPS                                    equ 0E25h
// bitfield definitions
TXPPS_TXPPS_POSN                         equ 0000h
TXPPS_TXPPS_POSITION                     equ 0000h
TXPPS_TXPPS_SIZE                         equ 0005h
TXPPS_TXPPS_LENGTH                       equ 0005h
TXPPS_TXPPS_MASK                         equ 001Fh
TXPPS_TXCKPPS0_POSN                      equ 0000h
TXPPS_TXCKPPS0_POSITION                  equ 0000h
TXPPS_TXCKPPS0_SIZE                      equ 0001h
TXPPS_TXCKPPS0_LENGTH                    equ 0001h
TXPPS_TXCKPPS0_MASK                      equ 0001h
TXPPS_TXCKPPS1_POSN                      equ 0001h
TXPPS_TXCKPPS1_POSITION                  equ 0001h
TXPPS_TXCKPPS1_SIZE                      equ 0001h
TXPPS_TXCKPPS1_LENGTH                    equ 0001h
TXPPS_TXCKPPS1_MASK                      equ 0002h
TXPPS_TXCKPPS2_POSN                      equ 0002h
TXPPS_TXCKPPS2_POSITION                  equ 0002h
TXPPS_TXCKPPS2_SIZE                      equ 0001h
TXPPS_TXCKPPS2_LENGTH                    equ 0001h
TXPPS_TXCKPPS2_MASK                      equ 0004h
TXPPS_TXCKPPS3_POSN                      equ 0003h
TXPPS_TXCKPPS3_POSITION                  equ 0003h
TXPPS_TXCKPPS3_SIZE                      equ 0001h
TXPPS_TXCKPPS3_LENGTH                    equ 0001h
TXPPS_TXCKPPS3_MASK                      equ 0008h
TXPPS_TXCKPPS4_POSN                      equ 0004h
TXPPS_TXCKPPS4_POSITION                  equ 0004h
TXPPS_TXCKPPS4_SIZE                      equ 0001h
TXPPS_TXCKPPS4_LENGTH                    equ 0001h
TXPPS_TXCKPPS4_MASK                      equ 0010h

